JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_sysctrl.c
        case 0x02:  /* PLL used as system clock */
            pll_div = CW_SYSCTRL->PLL_f.DIV;
            pll_src = CW_SYSCTRL->PLL_f.SOURCE;
            pll_mul = CW_SYSCTRL->PLL_f.MUL;

            if (pll_src)    // HSE
            {
                u32rtnVal = HSE_VALUE / (pll_div + 1) / 2 * pll_mul ;
            }
            else
            {
                u32rtnVal = HSIOSC_VALUE / 2 / (pll_div + 1) / 2 * pll_mul;
            }

            break;

        case 0x03:  /* LSI used as system clock */
            u32rtnVal = LSI_VALUE;
            break;

        case 0x04:  /* LSE used as system clock */
            u32rtnVal = LSE_VALUE;
            break;

        default:
            u32rtnVal = (HSIOSC_VALUE / hsiprs_tbl[hsiprs]);
            break;
    }

    u32rtnVal = (u32rtnVal >> CW_SYSCTRL->CR0_f.HCLKPRS);
    return u32rtnVal;
}

/**
 * @brief 获得外设时钟（PCLK）频率值
 *
 * @return uint32_t    PCLK频率值(Hz)
 */
uint32_t SYSCTRL_GetPClkFreq(void)
{
    uint32_t u32Val = 0;

    u32Val = SYSCTRL_GetHClkFreq();
    u32Val = (u32Val >> (CW_SYSCTRL->CR0_f.PCLKPRS));
    return u32Val;
}

/**
* @brief  Enable HSI
* @param  HSIDiv:
*   SYSCTRL_HSIOSC_DIV1
*   SYSCTRL_HSIOSC_DIV2
*   SYSCTRL_HSIOSC_DIV3
*   SYSCTRL_HSIOSC_DIV4
*   SYSCTRL_HSIOSC_DIV5
*   SYSCTRL_HSIOSC_DIV6
*   SYSCTRL_HSIOSC_DIV7
*   SYSCTRL_HSIOSC_DIV8
*   SYSCTRL_HSIOSC_DIV9
*   SYSCTRL_HSIOSC_DIV10
*   SYSCTRL_HSIOSC_DIV12
*   SYSCTRL_HSIOSC_DIV16
*   SYSCTRL_HSIOSC_DIV20
*   SYSCTRL_HSIOSC_DIV24
*   SYSCTRL_HSIOSC_DIV28
*   SYSCTRL_HSIOSC_DIV32
*
* @retval 0:success, 1:fault
*/
int SYSCTRL_HSI_Enable(uint32_t HSIDiv)
{
#if defined (HSI_STARTUP_TIMEOUT)
    uint16_t timeout = HSI_STARTUP_TIMEOUT;
#else
    uint16_t timeout = 0xffff;
#endif

    assert_param(IS_SYSCTRL_HSIOSC_DIV(HSIDiv));    

    if (HSIDiv == SYSCTRL_HSIOSC_DIV1)    // 96MHz
    {
        REGBITS_SET(CW_SYSCTRL->CR2,0x5A5A0000 | bv4 | bv5);    // 防止直接切入高速时钟时，FLASH没有加入等待周期，造成宕机        
    }
    else if (HSIDiv == SYSCTRL_HSIOSC_DIV2 || HSIDiv == SYSCTRL_HSIOSC_DIV3)    // 24~48MHz
    {
        if (CW_SYSCTRL->HSI_f.DIV == 1)    // 当前为96MHz，向低速切换，先降频，再改FLASH的等待配置
        {
            CW_SYSCTRL->HSI = (HSIDiv) | ((*((volatile uint16_t*)SYSCTRL_HSI_TRIMCODEADDR)) & 0x7FF);                
        }       
        
        REGBITS_SET(CW_SYSCTRL->CR2,0x5A5A0000 | bv4);    // 防止直接切入高速时钟时，FLASH没有加入等待周期，造成宕机
         
    }
    else    // <=24
    {
        if (CW_SYSCTRL->HSI_f.DIV <= 3)    // 向低速切换，先降频，再改FLASH的等待配置
        {
            CW_SYSCTRL->HSI = (HSIDiv) | ((*((volatile uint16_t*)SYSCTRL_HSI_TRIMCODEADDR)) & 0x7FF);                
        }     
       
        CW_SYSCTRL->CR2 = 0x5A5A0000 | (CW_SYSCTRL->CR2 & (~(0xFFFF0000|bv4|bv5|bv6)));   
    }
    
    CW_SYSCTRL->HSI = (HSIDiv) | ((*((volatile uint16_t*)SYSCTRL_HSI_TRIMCODEADDR)) & 0x7FF); 
    
    CW_SYSCTRL->CR1 |= SYSCTRL_KEY | SYSCTRL_CR1_HSIEN_Msk;                   //Enable HSI

    while (((CW_SYSCTRL->HSI & SYSCTRL_HSI_STABLE_Msk) == 0) && timeout)
    {
        timeout--;
    }//Wait stable

    if (timeout == 0) return 1;

    return 0;
}

/**
* @brief  Disable HSI
* @param  None.
* @retval 0:success, 1:fault
*/
void SYSCTRL_HSI_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) & \
                       (~SYSCTRL_CR1_HSIEN_Msk));
}


/**
* @brief  Enable LSI
* @param  None:
* @retval None
*/
int SYSCTRL_LSI_Enable(void)
{
    uint16_t timeout = 0xffff;

    CW_SYSCTRL->LSI |= SYSCTRL_LSI_WAITCYCLE_258;                                     //WaitCycle = 258
    CW_SYSCTRL->CR1 |= SYSCTRL_KEY | SYSCTRL_CR1_LSIEN_Msk;                    //Enable LSI

    while (((CW_SYSCTRL->LSI & SYSCTRL_LSI_STABLE_Msk) == 0) && timeout)
    {
        timeout--;
    }        //Wait stable

    if (timeout == 0) return 1;

    return 0;
}

/**
* @brief  Disable LSI
* @param  None.
* @retval None.
*/
void SYSCTRL_LSI_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) & \
                       (~SYSCTRL_CR1_LSIEN_Msk));
}

/**
* @brief  Set the HSE WAITCYCLE
* @param  WaitClock: SYSCTRL_HSE_WAITCYCLE_8192,SYSCTRL_HSE_WAITCYCLE_32768,
*                    SYSCTRL_HSE_WAITCYCLE_131072, SYSCTRL_HSE_WAITCYCLE_262144
* @retval None.
*/
void SYSCTRL_HSEWaitClockSet(uint32_t WaitClock)
{

    REGBITS_MODIFY(CW_SYSCTRL->HSE, SYSCTRL_HSE_WAITCYCLE_Msk, WaitClock);
}

/**
* @brief  Set the HEX enable pin polarity
* @param  Polarity: SYSCTRL_HEX_ENPOL_HIGH,SYSCTRL_HEX_ENPOL_LOW
*
* @retval None.
*/
void SYSCTRL_HEXEnablePinPolSet(uint32_t Polarity)
{
    // HEXEN pin PA05
    CW_SYSCTRL->AHBEN |= SYSCTRL_KEY | SYSCTRL_AHBEN_GPIOA_Msk;
    CW_GPIOA->DIR_f.PIN5 = 0;
    CW_GPIOA->ANALOG_f.PIN5 = 0;
    CW_GPIOA->AFRL_f.PIN5 = 5;

    REGBITS_MODIFY(CW_SYSCTRL->HSE, SYSCTRL_HSE_HEXENPOL_Msk, Polarity);
}

/**
* @brief  Enable HSE
* @param  Mode:   SYSCTRL_HSE_MODE_OSC: Oscillator,
*                 SYSCTRL_HSE_MODE_CLK: Input Clk
*
* @param  FreqIn: 4000000Hz ~ 32000000Hz
*
* @param  Driver: SYSCTRL_HSE_DRIVER_LEVEL0~SYSCTRL_HSE_DRIVER_LEVEL9 0:最小
*
* @param  Flt: SYSCTRL_HSE_FLT_OPEN,
*              SYSCTRL_HSE_FLT_CLOSE
*
* @retval None

注意：1、选择负载电容小的晶体更容易起振。
2、Flt: 强干扰环境打开,一般不打开
*/
int SYSCTRL_HSE_Enable(uint32_t Mode, uint32_t FreqIn, uint8_t Driver, uint32_t Flt)
{
    uint16_t timeout = 0xffff;
    uint16_t AHBEN_GPIO_Msk;
    //参数断言
    assert_param(IS_SYSCTRL_HSE_MODE(Mode));

    //根据HSE模式设置IO口功能
    if (HSE_PIN_PORT == CW_GPIOA)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOA_Msk;
    }
    else if (HSE_PIN_PORT == CW_GPIOB)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOB_Msk;
    }
    else if (HSE_PIN_PORT == CW_GPIOC)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOC_Msk;
    }
    else if (HSE_PIN_PORT == CW_GPIOF)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOF_Msk;
    }

    CW_SYSCTRL->AHBEN |= SYSCTRL_KEY | AHBEN_GPIO_Msk; //Open GPIO Clk

    if (Mode == SYSCTRL_HSE_MODE_OSC)                 //Oscillator
    {
        HSE_PIN_PORT->ANALOG |=  HSE_PIN_IN | HSE_PIN_OUT;
    }
    else                                          //Input clk
    {
        CW_GPIOA->ANALOG &= ~HSE_PIN_IN;
        CW_GPIOA->DIR    |=  HSE_PIN_IN;
        CW_GPIOA->PUR    &= ~HSE_PIN_IN;
    }

    //设置HSE参数
    CW_SYSCTRL->HSE = 0x00200000 /* PDRIVER = 01 */ | ((8000000000 / FreqIn) << SYSCTRL_HSE_DETCNT_Pos) | \
                      (Mode) | \
                      (SYSCTRL_HSE_WAITCYCLE_131072) | \
                      (Driver) | \
                      (Flt);
    //使能HSE,同时使能CLKCCS和HSECCS，使能时钟失效切换
    CW_SYSCTRL->CR1 |= SYSCTRL_KEY | SYSCTRL_CR1_CLKCCS_Msk | SYSCTRL_CR1_HSECCS_Msk | SYSCTRL_CR1_HSEEN_Msk;  //Enable HSE

    //等待HSE稳定
    while (((CW_SYSCTRL->HSE & SYSCTRL_HSE_STABLE_Msk) != SYSCTRL_HSE_STABLE_Msk) && timeout)
    {
        timeout--;        //Wait stable
    }

    if (timeout == 0) return 1;

