JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_sysctrl.c
    return 0;
}

/**
* @brief  Disable HSE
* @param  None.
* @retval None.
*/
void SYSCTRL_HSE_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~ SYSCTRL_CR1_KEY_Msk)) | SYSCTRL_KEY) & \
                       (~SYSCTRL_CR1_HSEEN_Msk));
}


/**
* @brief  Enable LSE
* @param  Mode:   SYSCTRL_LSE_MODE_OSC: Oscillator,
*                 SYSCTRL_LSE_MODE_CLK: Input Clk
* @param  Driver: SYSCTRL_LSE_DRIVER_LEVEL0~15
*
* @retval  0：succes， 1：fault

驱动配置建议：
Driver：SYSCTRL_LSE_DRIVER_LEVEL2
*/

int SYSCTRL_LSE_Enable(uint32_t Mode, uint8_t Driver)
{
    uint32_t timeout = 0x4ffff;
    uint16_t AHBEN_GPIO_Msk;
    //参数断言
    assert_param(IS_SYSCTRL_LSE_MODE(Mode));
    assert_param(IS_SYSCTRL_LSE_DRIVER(Driver));

    //根据LSE模式，设置IO功能
    if (LSE_PIN_PORT == CW_GPIOA)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOA_Msk;
    }
    else if (LSE_PIN_PORT == CW_GPIOB)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOB_Msk;
    }
    else if (LSE_PIN_PORT == CW_GPIOC)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOC_Msk;
    }
    else if (LSE_PIN_PORT == CW_GPIOF)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOF_Msk;
    }

    CW_SYSCTRL->AHBEN |= SYSCTRL_KEY | AHBEN_GPIO_Msk;

    if (Mode == SYSCTRL_LSE_MODE_OSC)                //Oscillator
    {
        LSE_PIN_PORT->ANALOG |= LSE_PIN_IN | LSE_PIN_OUT;
    }
    else                                          //Input clk
    {
        LSE_PIN_PORT->ANALOG &= ~LSE_PIN_IN;
        LSE_PIN_PORT->DIR |= LSE_PIN_IN;
        LSE_PIN_PORT->PUR &= LSE_PIN_IN;
    }

    //设置LSE参数
    CW_SYSCTRL->LSE = 0x00000A20 | (Mode) | (Driver);

    //LSE使能,同时使能CLKCCS和LSECCS，使能时钟失效切换
    CW_SYSCTRL->CR1 |= SYSCTRL_KEY | SYSCTRL_CLKCCSEN | SYSCTRL_CR1_LSECCS_Msk | SYSCTRL_CR1_LSEEN_Msk;                    //Enable LSE

    //等待LSE稳定
    while ((CW_SYSCTRL->LSE_f.STABLE == 0) && timeout)
    {
        timeout--;
    }//Wait stable

    if (timeout == 0) return 1;

    return 0;
}

/**
* @brief  Disable LSE
* @param  None
* @retval None
*/
void SYSCTRL_LSE_Disable(void)
{
    CW_SYSCTRL->CR1 = (((CW_SYSCTRL->CR1 & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) & \
                       (~SYSCTRL_CR1_LSEEN_Msk));
}

/**
* @brief  Enable PLL
* @param  PLL_InitStruct:
*         .ClockSource    SYSCTRL_PLL_SOURCE_HSI_48M, SYSCTRL_PLL_SOURCE_HSE
*         .SourceFreq     <= 80 000 000Hz
*         .PLL_OutFreq    36000000 <= PLL_OutFreq<= 96 000 000Hz
*         .WaitCycle      SYSCTRL_PLL_WAIT_CYCLE_128~16384
* @retval 0:success, 1:fault
*/

int SYSCTRL_PLL_Enable(PLL_InitTypeDef *PLL_InitStruct)
{
    uint8_t i, j, mul, div,mul_array[60], mul_tmp, div_tmp;
    uint16_t timeout = 0xffff;
    uint32_t res, div_res, diff_tmp, diff = 0xFFFFFFFF;

    #define ABS(a,b)      (a)>(b) ? (a)-(b): (b)-(a)
    // 计算mul
    for (i = 0, mul = 24; ; mul++)
    {
        res = PLL_InitStruct->PLL_OutFreq / mul;

        if (res > 2500000)
        {
            continue;
        }

        if (res < 1500000)
        {
            break;
        }

        mul_array[i] = mul;
        i++;
    }

    for (j = 0; j < i; j++)
    {
        mul_tmp = mul_array[j];
        res = PLL_InitStruct->PLL_OutFreq / mul_tmp;
        res <<= 1;

        for (div_tmp = 0; div_tmp < 16; div_tmp++)
        {
            div_res = PLL_InitStruct->SourceFreq / (div_tmp + 1);

            if (div_res == res)
            {
                div = div_tmp;
                mul = mul_tmp;

                goto RESULT;
            }
            diff_tmp = ABS(res, div_res);
            if (diff_tmp < diff)
            {
                diff = diff_tmp;
                div = div_tmp;
                mul = mul_tmp;
            }            
        }
    }

RESULT:
    // 停止PLL
    CW_SYSCTRL->CR1 = (CW_SYSCTRL->CR1 & (~SYSCTRL_CR1_PLLEN_Msk)) | SYSCTRL_KEY;

    //设置PLL参数
    CW_SYSCTRL->PLL = PLL_InitStruct->WaitCycle | \
                      mul << SYSCTRL_PLL_MUL_Pos | \
                      div << SYSCTRL_PLL_DIV_Pos | \
                      PLL_InitStruct->ClockSource;

    //使能PLL
    CW_SYSCTRL->CR1 |= SYSCTRL_KEY | SYSCTRL_CR1_PLLEN_Msk;     //Enable PLL

    //等待PLL时钟稳定
    while (((CW_SYSCTRL->PLL & SYSCTRL_PLL_STABLE_Msk) != SYSCTRL_PLL_STABLE_Msk) && timeout)
    {
        timeout--;
    }

    if (timeout == 0) return 1;

    return 0;
}

/**
* @brief  Disable PLL
* @param  None
* @retval None
*/
void SYSCTRL_PLL_Disable(void)
{
    CW_SYSCTRL->CR1 = (CW_SYSCTRL->CR1 & (~SYSCTRL_CR1_PLLEN_Msk)) | SYSCTRL_KEY;
}



/**
* @brief  CLKSRC switch
* @param  NewClk:
*                SYSCTRL_SYSCLKSRC_HSI,
*                SYSCTRL_SYSCLKSRC_HSE,
*                SYSCTRL_SYSCLKSRC_LSI,
*                SYSCTRL_SYSCLKSRC_LSE
* @retval 0: PASS, 1: Fail
*
* NOTE:调用此函数之前需要保证新时钟源已经使能（ENABLE函数中已包含等待时钟稳定过程）。
*/

int SYSCTRL_SysClk_Switch(uint32_t NewClk)
{
    assert_param(IS_SYSCTRL_SYSCLKSRC(NewClk));

    switch (NewClk)
    {
        default:
        case SYSCTRL_SYSCLKSRC_HSI:
            if ((CW_SYSCTRL->ISR_f.HSIRDY == 0) || (CW_SYSCTRL->ISR_f.HSISTABLE == 0))
                return 1;

            break;

        case SYSCTRL_SYSCLKSRC_HSE:
            if (CW_SYSCTRL->ISR_f.HSESTABLE == 0)
                return 1;

            break;

        case SYSCTRL_SYSCLKSRC_PLL:
            if (CW_SYSCTRL->ISR_f.PLLSTABLE == 0)
                return 1;

            break;

        case SYSCTRL_SYSCLKSRC_LSI:
            if ((CW_SYSCTRL->ISR_f.LSIRDY == 0) || (CW_SYSCTRL->ISR_f.LSISTABLE == 0))
                return 1;

            break;

        case SYSCTRL_SYSCLKSRC_LSE:
            if ((CW_SYSCTRL->ISR_f.LSEFAIL == 1) || (CW_SYSCTRL->ISR_f.LSERDY == 0) || \
                    (CW_SYSCTRL->ISR_f.LSESTABLE == 0) || (CW_SYSCTRL->ISR_f.LSEFAIL == 1))
                return 1;

            break;
    }

    CW_SYSCTRL->CR0 = (CW_SYSCTRL->CR0 & (~SYSCTRL_CR0_SYSCLK_Msk)) | (NewClk) | SYSCTRL_KEY;

    SYSCTRL_SystemCoreClockUpdate(SYSCTRL_GetHClkFreq());

    return (((CW_SYSCTRL->CR0 & SYSCTRL_CR0_SYSCLK_Msk) == NewClk) ? 0U : 1U);
}

/**
 * @brief SYSCTRL中断配置
 *
 * @param SYSCTRL_IT ：SYSCTRL_IT_LSEFAULT SYSCTRL_IT_LSEFAIL
 *                 SYSCTRL_IT_LSERDY     SYSCTRL_IT_LSIRDY
 *                 SYSCTRL_IT_HSIRDY
 * @param NewState  :ENABLE  DISABLE
 */
void SYSCTRL_ITConfig(uint32_t SYSCTRL_IT, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_IT(SYSCTRL_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

