JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_sysctrl.c
    if (NewState != DISABLE)     //IER have KEY attribute
    {
        CW_SYSCTRL->IER = ((CW_SYSCTRL->IER & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) | SYSCTRL_IT;
    }
    else                         //IER have KEY attribute
    {
        CW_SYSCTRL->IER = ((CW_SYSCTRL->IER & (~SYSCTRL_KEY_MASK)) | SYSCTRL_KEY) & (~SYSCTRL_IT);
    }
}

/**
 * @brief 获取SYSCTRL指定中断状态
 *
 * @param SYSCTRL_IT ： SYSCTRL_IT_LSEFAULT    SYSCTRL_IT_LSEFAIL
 *                 SYSCTRL_IT_LSERDY     SYSCTRL_IT_LSIRDY
 *                 SYSCTRL_IT_HSIRDY
 *
 * @return ITStatus  : SET   RESET
 */
ITStatus SYSCTRL_GetITStatus(uint32_t SYSCTRL_IT)
{
    assert_param(IS_SYSCTRL_GET_IT(SYSCTRL_IT));

    return (CW_SYSCTRL->ISR & SYSCTRL_IT) ? SET : RESET;
}


/**
 * @brief 清除SYSCTRL指定中断标志
 *
 * @param SYSCTRL_IT ：SYSCTRL_IT_LSEFAULT     SYSCTRL_IT_LSEFAIL
 *                 SYSCTRL_IT_LSERDY     SYSCTRL_IT_LSIRDY
 *                 SYSCTRL_IT_HSIRDY
 *
 */
void SYSCTRL_ClearITPendingBit(uint32_t SYSCTRL_IT)
{
    assert_param(IS_SYSCTRL_GET_IT(SYSCTRL_IT));

    CW_SYSCTRL->ICR &= (~SYSCTRL_IT);
}

/**
 * @brief 获取指定时钟源稳定标志
 *
 * @param SYSCTRL_STABLEFLAG ：SYSCTRL_FLAG_HSISTABLE  SYSCTRL_FLAG_HEXSTABLE
 *                         SYSCTRL_FLAG_LSESTABLE
 *                         SYSCTRL_FLAG_LSISTABLE
 * @return FlagStatus ：SET   RESET
 */
FlagStatus SYSCTRL_GetStableFlag(uint32_t SYSCTRL_STABLEFLAG)
{
    assert_param(IS_SYSCTRL_STABLEFLAG(SYSCTRL_STABLEFLAG));

    return (((CW_SYSCTRL->ISR) & SYSCTRL_STABLEFLAG) ? SET : RESET);
}

/**
 * @brief  获取所有时钟源稳定标志
 *
 * @return uint32_t ：返回ISR寄存器内容
 */
uint32_t SYSCTRL_GetAllStableFlag(void)
{
    return (CW_SYSCTRL->ISR);
}


/**
 * @brief AHB外设时钟设置
 *
 * @param Periph  ：SYSCTRL_AHB_PERIPH_GPIOA   SYSCTRL_AHB_PERIPH_GPIOB
 *                  SYSCTRL_AHB_PERIPH_CRC     SYSCTRL_AHB_PERIPH_FLASH
 * @param NewState  ENABLE  DISABLE
 */
void SYSCTRL_AHBPeriphClk_Enable(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_AHB_PERIPH(Periph));

    if (NewState != DISABLE)
    {
        CW_SYSCTRL->AHBEN |= SYSCTRL_KEY | Periph;
    }
    else
    {
        CW_SYSCTRL->AHBEN = SYSCTRL_KEY | (CW_SYSCTRL->AHBEN & (~Periph));
    }
}

/**
 * @brief APB外设时钟设置1
 *
 * @param Periph   ：  SYSCTRL_APB1_PERIPH_ATIM    SYSCTRL_APB1_PERIPH_GTIM1
 *                     SYSCTRL_APB1_PERIPH_UART2   SYSCTRL_APB1_PERIPH_UART1
 *                     SYSCTRL_APB1_PERIPH_SPI    SYSCTRL_APB1_PERIPH_VC
 *                     SYSCTRL_APB1_PERIPH_ADC
 * @param NewState  ENABLE  DISABLE
 */
void SYSCTRL_APBPeriphClk_Enable1(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_APB1_PERIPH(Periph));

    if (NewState != DISABLE)
    {
        CW_SYSCTRL->APBEN1 |= SYSCTRL_KEY | Periph;
    }
    else
    {
        CW_SYSCTRL->APBEN1 = SYSCTRL_KEY | (CW_SYSCTRL->APBEN1 & (~Periph));
    }
}

/**
 * @brief APB外设时钟设置2
 *
 * @param Periph ：  SYSCTRL_APB2_PERIPH_I2C       SYSCTRL_APB2_PERIPH_LPTIM
 *                   SYSCTRL_APB2_PERIPH_IWDT      SYSCTRL_APB2_PERIPH_RTC
 *                   SYSCTRL_APB2_PERIPH_BTIM123
 * @param NewState :  ENABLE  DISABLE
 */
void SYSCTRL_APBPeriphClk_Enable2(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_APB2_PERIPH(Periph));

    if (NewState != DISABLE)
    {
        CW_SYSCTRL->APBEN2 |= SYSCTRL_KEY | Periph;
    }
    else
    {
        CW_SYSCTRL->APBEN2 = SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~Periph));
    }
}

/**
 * @brief AHB外设复位设置
 *
 * @param Periph  ：SYSCTRL_AHB_PERIPH_GPIOA   SYSCTRL_AHB_PERIPH_GPIOB
 *                  SYSCTRL_AHB_PERIPH_CRC     SYSCTRL_AHB_PERIPH_FLASH
 * @param NewState  : ENABLE  DISABLE
 */
void SYSCTRL_AHBPeriphReset(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_AHB_PERIPH(Periph));

    if (NewState != DISABLE)
    {
        CW_SYSCTRL->AHBRST |= Periph;
    }
    else
    {
        CW_SYSCTRL->AHBRST &= (~Periph);
    }
}

/**
 * @brief APB外设复位设置1
 *
 * @param Periph   ：  SYSCTRL_APB1_PERIPH_ATIM    SYSCTRL_APB1_PERIPH_GTIM1
 *                     SYSCTRL_APB1_PERIPH_UART2   SYSCTRL_APB1_PERIPH_UART1
 *                     SYSCTRL_APB1_PERIPH_SPI1    SYSCTRL_APB1_PERIPH_VC
 *                     SYSCTRL_APB1_PERIPH_ADC
 * @param NewState  : ENABLE  DISABLE
 */
void SYSCTRL_APBPeriphReset1(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_APB1_PERIPH(Periph));

    if (NewState != ENABLE)
    {
        CW_SYSCTRL->APBRST1 |= Periph;
    }
    else
    {
        CW_SYSCTRL->APBRST1 &= (~Periph);
    }
}

/**
 * @brief APB外设复位设置2
 *
 * @param Periph ：  SYSCTRL_APB2_PERIPH_I2C       SYSCTRL_APB2_PERIPH_LPTIM
 *                   SYSCTRL_APB2_PERIPH_IWDT      SYSCTRL_APB2_PERIPH_RTC
 *                   SYSCTRL_APB2_PERIPH_BTIM123
 * @param NewState : ENABLE  DISABLE
 */
void SYSCTRL_APBPeriphReset2(uint32_t Periph, FunctionalState NewState)
{
    assert_param(IS_SYSCTRL_APB1_PERIPH(Periph));

    if (NewState != ENABLE)
    {
        CW_SYSCTRL->APBRST2 |= Periph;
    }
    else
    {
        CW_SYSCTRL->APBRST2 &= (~Periph);
    }
}

/**
 * @brief 获取指定的系统复位标志
 *
 * @param SYSCTRL_RSTFLAG  ：SYSCTRL_FLAG_PORRST   SYSCTRL_FLAG_SYSRESETREQRST
 *                           SYSCTRL_FLAG_LVDRST   SYSCTRL_FLAG_LOCKUPRST
 *                           SYSCTRL_FLAG_IWDTRST  SYSCTRL_FLAG_RSTBRST
 * @return FlagStatus  SET RESET
 */
FlagStatus SYSCTRL_GetRstFlag(uint32_t SYSCTRL_RSTFLAG)
{
    assert_param(IS_SYSCTRL_RSTFLAG(SYSCTRL_RSTFLAG));

    return (((CW_SYSCTRL->RESETFLAG) & SYSCTRL_RSTFLAG) ? SET : RESET);
}

/**
 * @brief 获取复位标志寄存器内容
 *
 * @return uint32_t
 */
uint32_t SYSCTRL_GetAllRstFlag(void)
{
    return (CW_SYSCTRL->RESETFLAG);
}

/**
 * @brief 清除指定或者全部复位标志
 *
 * @param SYSCTRL_RSTFLAG  ：SYSCTRL_FLAG_PORRST   SYSCTRL_FLAG_SYSRESETREQRST
 *                           SYSCTRL_FLAG_LVDRST   SYSCTRL_FLAG_LOCKUPRST
 *                           SYSCTRL_FLAG_IWDTRST  SYSCTRL_FLAG_RSTBRST
 * @return
 */
void SYSCTRL_ClearRstFlag(uint32_t SYSCTRL_RSTFLAG)
{
    assert_param(IS_SYSCTRL_RSTFLAG(SYSCTRL_RSTFLAG));
    CW_SYSCTRL->RESETFLAG &= (~SYSCTRL_RSTFLAG);
}

/**
 * @brief 配置PCLK_OUT引脚(PA02)输出PCLK时钟
 *
 */
void SYSCTRL_PCLK_OUT(void)
{
    int16_t AHBEN_GPIO_Msk;

