JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_sysctrl.c
    if (PCLK_OUT_PIN_PORT == CW_GPIOA)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOA_Msk;
    }
    else if (PCLK_OUT_PIN_PORT == CW_GPIOB)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOB_Msk;
    }
    else if (PCLK_OUT_PIN_PORT == CW_GPIOC)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOC_Msk;
    }
    else if (PCLK_OUT_PIN_PORT == CW_GPIOF)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOF_Msk;
    }

    CW_SYSCTRL->AHBEN |= SYSCTRL_KEY | AHBEN_GPIO_Msk;
    PCLK_OUT_PIN_PORT->ANALOG &= ~PCLK_OUT_PIN;  //Digit
    PCLK_OUT_PIN_PORT->DIR &= ~PCLK_OUT_PIN;     //Output
    GPIO_SetAlternateFunction(PCLK_OUT_PIN_PORT, PCLK_OUT_PIN, PCLK_OUT_PIN_AF);
}

/**
 * @brief  配置MCO_OUT引脚(PA04)输出指定的时钟源及分频比
 *
 * @param Source  ：SYSCTRL_MCO_SRC_NONE    SYSCTRL_MCO_SRC_HCLK
 *                  SYSCTRL_MCO_SRC_PCLK    SYSCTRL_MCO_SRC_HSI
 *                  SYSCTRL_MCO_SRC_LSI     SYSCTRL_MCO_SRC_HSE
 *                  SYSCTRL_MCO_SRC_LSE
 *
 * @param Div     ：SYSCTRL_MCO_DIV1/2/8/64/128/256/512/1024
 */
void SYSCTRL_MCO_OUT(uint8_t Source, uint8_t Div)
{
    uint16_t AHBEN_GPIO_Msk;

    assert_param(IS_SYSCTRL_MCO_SRC(Source));
    assert_param(IS_SYSCTRL_MCO_DIV(Div));

    if (MCO_PIN_PORT == CW_GPIOA)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOA_Msk;
    }
    else if (MCO_PIN_PORT == CW_GPIOB)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOB_Msk;
    }
    else if (MCO_PIN_PORT == CW_GPIOC)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOC_Msk;
    }
    else if (MCO_PIN_PORT == CW_GPIOF)
    {
        AHBEN_GPIO_Msk = SYSCTRL_AHBEN_GPIOF_Msk;
    }

    CW_SYSCTRL->AHBEN |= SYSCTRL_KEY | AHBEN_GPIO_Msk;
    MCO_PIN_PORT->ANALOG &= ~MCO_PIN;  //Digit
    MCO_PIN_PORT->DIR &= ~MCO_PIN;     //Output
    GPIO_SetAlternateFunction(MCO_PIN_PORT, MCO_PIN, MCO_PIN_AF);

    CW_SYSCTRL->MCO = (uint32_t)(Source | Div);
}
void SYSCTRL_GotoSleep(void)
{
    SCB->SCR &= ~(SCB_SCR_SLEEPDEEP_Msk);
    __DSB();
    __WFI();
}

void SYSCTRL_GotoDeepSleep(void)
{
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
    __DSB();
    __WFI();
}

void SYSCTRL_ConfigSleepOnExit(FunctionalState state)
{
    if (state == ENABLE)
    {
        SCB->SCR |= SCB_SCR_SLEEPONEXIT_Msk;
    }
    else
    {
        SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;
    }
}
